---
kind: method
id: M:Autodesk.Revit.DB.EdgeArrayArrayIterator.#ctor
source: html/bd28ff31-a67d-3692-b7a4-798336da6ad7.htm
---
# Autodesk.Revit.DB.EdgeArrayArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public EdgeArrayArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.